In [1]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv("titles.csv")
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head(10)

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
8,"Lapis, Ballpen at Diploma, a True to Life Journey",2014,Jori ' Danilo' Jurado Jr.,actor,Jaime (young),9.0
9,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN

### How many movies are listed in the titles dataframe?

In [4]:
titles.info() # seems 232330

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232330 entries, 0 to 232329
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   232330 non-null  object
 1   year    232330 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values(by=["year"]).head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
hamlet_ = titles[titles["title"].str.contains("Hamlet")]
hamlet_.info() # 54

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54 entries, 4394 to 227105
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   54 non-null     object
 1   year    54 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.3+ KB

### How many movies are titled "North by Northwest"?

In [7]:
titles[titles["title"].str.contains("North by Northwest")]

                     title  year
139311  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [8]:
hamlet_.sort_values(by=["year"]).head(1)

        title  year
46721  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
titles[titles["title"].str.contains("Treasure Island")].sort_values(by="year")

                                                    title  year
206027                                    Treasure Island  1918
51287                                     Treasure Island  1920
191050                                    Treasure Island  1934
144440                      The Secret of Treasure Island  1938
59773                     Charlie Chan at Treasure Island  1939
96934                                     Treasure Island  1950
187404                          Return to Treasure Island  1954
65156                           Five on a Treasure Island  1957
89534                                     Treasure Island  1972
111343                                    Treasure Island  1973
205397                                    Treasure Island  1985
130842                             Muppet Treasure Island  1996
153428                               Treasure Island (II)  1999
179354                                    Treasure Island  1999
28183                          Pirates of Treasure Island  2006
180487  Treasure Island Kids: The Mystery of Treasure ...  2006
217992  Treasure Island Kids: The Battle of Treasure I...  2006
223604  Treasure Island Kids: The Monster of Treasure ...  2006
191707             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [10]:
titles[titles["year"].isin([1950])].info() # 1099 it seems

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1099 entries, 71 to 232004
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   1099 non-null   object
 1   year    1099 non-null   int64
dtypes: int64(1), object(1)
memory usage: 25.8+ KB

### How many movies were made in the year 1960?

In [11]:
titles[titles["year"].isin([1960])].info() # 1501

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1501 entries, 104 to 232104
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   1501 non-null   object
 1   year    1501 non-null   int64
dtypes: int64(1), object(1)
memory usage: 35.2+ KB

### How many movies were made from 1950 through 1959?

In [12]:
titles[titles["year"].between(1950, 1959)].info()
# or titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12711 entries, 40 to 232291
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   12711 non-null  object
 1   year    12711 non-null  int64
dtypes: int64(1), object(1)
memory usage: 297.9+ KB

### In what years has a movie titled "Batman" been released?

In [13]:
batman_ = titles[titles["title"].str.contains("Batman")].sort_values(by="year")
for year in batman_["year"]:
    print(year)

1943
1949
1964
1965
1966
1966
1967
1973
1989
1991
1992
1993
1995
1997
2005
2010
2010
2012
2014
2014
2016
2016
2016
2016
2016
2016
2017
2017

### How many roles were there in the movie "Inception"?

In [14]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
inception_ = cast[cast["title"].str.contains("Inception")]
inception_ # 86 rows

,title,year,name,type,character,n
56506,Fraud in the Inception: Who killed Robert Haml...,2013,Sky Anderson,actor,Mac,NaN
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
...,...,...,...,...,...,...
3259597,Inception,2010,Ellen Page,actress,Ariadne,3.0
3313720,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3340319,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3347057,Inception,2010,Talulah Riley,actress,Blonde,25.0
3582980,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
inception_["name"].notnull().count()

86

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
sum(pd.isnull(inception_["name"]))

0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
nbnw = pd.DataFrame(cast[cast["title"].str.contains("North by Northwest")])
nbnw_s = pd.DataFrame(nbnw["n"].sort_values())
nbnw_s.dropna()

            n
845516    1.0
3382934   2.0
1413409   3.0
3043261   4.0
345822    5.0
2941468   6.0
1644542   7.0
1236791   8.0
2372617   9.0
1757154  10.0
646039   11.0
2225858  12.0
450691   13.0
1463316  14.0
199768   15.0
1343025  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
Sleuth = pd.DataFrame(cast[cast["title"].str.contains("Sleuth")])
Sleuth1972 = Sleuth.loc[Sleuth["year"]==1972]
Sleuth1972

,title,year,name,type,character,n
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

In [20]:
Sleuth1972.sort_values(by="n")

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [21]:
Sleuth2007 = Sleuth.loc[Sleuth["year"]==2007]
Sleuth2007.sort_values(by="n").dropna()

          title  year           name   type    character    n
316653   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1254632  Sleuth  2007       Jude Law  actor         Milo  2.0
1751872  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [22]:
Hamlet_ = pd.DataFrame(cast[cast["title"].str.contains("Hamlet")])
Hamlet_1921 = Hamlet_.loc[Hamlet_["year"]==1921]
len(Hamlet_1921["name"])

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [23]:
pd.DataFrame(titles[titles["title"].str.contains("Branagh")])

                                         title  year
130242  Branagh Theatre Live: Romeo and Juliet  2016

### How many "Hamlet" roles have been listed in all film credits through history?

In [24]:
len(pd.DataFrame(cast[cast["title"].str.contains("Hamlet")]))

921

### How many people have played an "Ophelia"?

In [25]:
len(pd.DataFrame(cast[cast["name"].str.contains("Ophelia")]))

48

### How many people have played a role called "The Dude"?

In [26]:
len(pd.DataFrame(cast[cast["name"].str.contains("The Dude")]))

2

### How many people have played a role called "The Stranger"?

In [27]:
len(pd.DataFrame(cast[cast["name"].str.contains("The Stranger")]))

1

### How many roles has Sidney Poitier played throughout his career?

In [28]:
len(cast[cast["name"].str.contains("Sidney Poitier")])

43

### How many roles has Judi Dench played?

In [29]:
len(cast[cast["name"].str.contains("Judi Dench")])

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [30]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [31]:
_n2 = cast[cast["n"] == 2]
cgrant = _n2[_n2["name"] == "Cary Grant"]
cgrant[cgrant["year"] == 1940]

                   title  year        name   type   character    n
845513  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [32]:
_n1 = cast[cast["n"] == 1]
cgrant1 = _n1[_n1["name"] == "Cary Grant"]

In [33]:
cgrant1[cgrant1["year"]==1940]

,title,year,name,type,character,n
845495,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
845539,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
845541,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [62]:
y1950 = cast[cast["year"] == 1950]
y1950actor = y1950[y1950["type"] == "actor"]
y1950actress = y1950[y1950["type"] == "actress"]

print(len(y1950actor))

5545
16598

### How many roles were avilable for actresses in the 1950s?

In [63]:
print(len(y1950actress))

5545

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?